orgs/org_mode.org
#+TITLE: org mode
* 标题操作              :work:
<tab> 收起展开标题
<shift>-<tab> 相反顺序收起展开
C-c C-n 跳到下一个标题（可跨层级）
C-c C-p 跳到上一个标题（可跨层级）
C-c C-f 跳到下一个标题（同层级）
C-c C-b 跳到上一个标题（同层级）
C-c C-u 跳到上一级标题（upper）

M-Ret插入一个标题（如果在文字中，插入一个一级标题〔毕竟它不好判断〕；如果在标题中，插入同级的标题）
M-left/right增加/缩减标题的层级
M-up/down将标题向上或向下移动


* TODO操作
M-S-<ret> 插入一个todo标题
C-c C-t 切换TODO状态
* 表格
|a|b|c|      -> <tab>键辅助调整


| 快捷键          |                                      desc                                    |
|---------------+------------------------------------------------------------------------------|
| C-c C-c       | 重新对齐表格                                                                    |
| TAB/S-TAB     | 重新对齐表格，并在横向格子里跳转                                                    |
| Ret           | 重新对齐表格，并跳到下一行的格子                                                    |
| M-方向键        | 将单元格所在的行/列进行上下移动                                                    |
| M-S-←/↑       | 删除光标所在的行列（记忆：这两个箭头都是指向表格内部，用于缩减表格，即删除）                 |
| M-S-→/↓       | 在光标所在的单元格前面或者上面，增加行或列（记忆：这两个箭头指向表格外部，用于扩充表格，即新增） |
| C-c -或者C-Ret | 新增一个分隔线，两个按键在生成分隔线后的光标行为不同                                    |
| C-c ^         | 对表格进行行排序                                                                 |

* 链接

C-c C-l 生成链接
#+begin_example
[[链接的URL或ID][]]
#+end_example

C-c C-o 打开链接



* 内容编辑操作
<q  按tab键生成代码块
<e  按tab键生成引用块
* 导出
C-c C-e 导出

* TODO [#A]标签 
在冒号之后，M-TAB 可以补全标签 (与windows应用切换快捷键冲突)
| 快捷键    | desc                                                                                           |
|---------+------------------------------------------------------------------------------------------------|
| C-c C-q | 为当前标题输入标签。Org 模式既支持补全，也支持单键接口来设置标签，见下文。回车之后，标签会被插入，并放到第 org-tags-column 列。如果用前缀 C-u，会把当前缓冲区中的所有标签都对齐到那一列，这看起来很酷。 |
| C-c C-c | 当光标处于标题上时，这个命令同C-c C-q。                                                               |
|         |                                                                                                |
* TODO [#B]日期
| 快捷键         | desc                                                                                           |
|--------------+------------------------------------------------------------------------------------------------|
|              |                                                                                                |
| C-c .        | 询问日期并输入正确的时间戳。当光标处理一个时间戳之上时，是修改这个时间戳，而不是插入一个新的。如果这个命令连用再次，就会插入一个时间段。加上前缀会附带当前时间。 |
| C-c !        | 功能同C-c .，但是插入的是一个未激活的时间戳。                                                          |
| S-LEFT/RIGHT | 将光标处理的时间戳改变一天。                                                                         |
| S-UP/DOWN    | 改变时间戳中光标下的项。光标可以处在年、月、日、时或者分之上。当时间戳包含一个时间段时，如 “15:30-16:30”，修改第一个时间，会自动同时修改第二个时间，以保持时间段长度不变。想修改时间段长度，可以修改第二个时间。 |

** deadline 截止时间
SCHEDULED: <2024-03-06 周三> DEADLINE: <2024-03-05 周二>
| 快捷键    | desc                                        |
|---------+---------------------------------------------|
| C-c C-d | 在标题下面一行插入一个带有“DEADLINE”关键字的时间戳。 |
| C-c C-s | 在标题下面插入一个带有“SCHEDULED”关键字的时间戳。   |
* TODO [#C]属性
